export const addressDB = {
    "서울특별시" : [
        "강남구", "강동구","강북구","강서구","관악구","광진구","구로구","금천구","노원구","도봉구",
        "동대문구","동작구","마포구","서대문구","서초구","성동구","성북구","송파구","양천구","영등포구",
        "용산구","은평구","종로구","중구","중랑구"
    ],
    "경기도" : [
        "가평군", "고양시 덕양구", "고양시 일산동구", "고양시 일산서구", "과천시", "광명시", "광주시", "구리시", "군포시", "김포시", "남양주시", "동두천시", "부천시", "성남시 분당구", "성남시 수정구", "성남시 중원구", "수원시 권선구", "수원시 영통구", "수원시 장안구", "수원시 팔달구", "시흥시", "안산시 단원구", "안산시 상록구", "안성시", "안양시 동안구", "안양시 만안구", "양주시", "양평군", "여주시", "연천군", "오산시", "용인시 기흥구", 
        "용인시 수지구", "용인시 처인구", "의왕시", "의정부시", "이천시", "파주시", "평택시", "포천시", "하남시", "화성시"
    ],
    "인천광역시": [
        "강화군", "계양구", "남동구", "동구", "미추홀구", "부평구", "서구", "연수구", "옹진군", "중구"
    ],
    "부산광역시" : [
        "강서구", "금정구", "기장군", "남구", "동구", "동래구", "부산진구", "북구", "사상구", "사하구", "서구", "수영구", "연제구", "영도구", "중구", "해운대구"
    ],
    "대전광역시" : [
        "대덕구", "동구", "서구", "유성구", "중구"
    ],
    "대구광역시" : [
        "남구", "달서구", "달성군", "동구", "북구", "서구", "수성구", "중구"
    ],
    "울산광역시" : [
        "남구", "동구", "북구", "울주군", "중구"
    ],
    "세종특별자치시" : [
        "세종시"
    ],
    "광주광역시" : [
        "광산구", "남구", "동구", "북구", "서구"
    ],
    "강원도" : [
        "강릉시", "고성군", "동해시", "삼척시", "속초시", "양구군", "양양군", "영월군", "원주시", "인제군", "정선군", 
        "철원군", "춘천시", "태백시", "평창군", "홍천군", "화천군", "횡성군"
    ],
    "충청북도" : [
        "괴산군", "단양군", "보은군", "영동군", "옥천군", "음성군", "제천시", "증평군", "진천군", "청주시 상당구", "청주시 서원구", "청주시 청권구", "청주시 흥덕구", "충주시"
    ],
    "충청남도" : [
        "계룡시", "공주시", "금산군", "논산시", "당진시", "보령시", "부여군", "서산시", "서천군", "아산시", "예산군", "천안시 동남구", "천안시 서북구", "청양군", "태안군", "홍성군"
    ],
    "경상북도" : [
        "경상시", "경주시", "고령군", "구미시", "군위군", "김천시", "문경시", "봉화군", "상주시", "성주군", "안동시", "영덕군", "영양군", "영주시", "영천시", "예천군", "울릉군", "울진군", "의성군", "청도군", "청송군", "칠곡군", "포항시 남구", "포항시 북구"
    ],
    "경상남도" : [
        "거제시", "거창군", "고성군", "김해시", "남해군", "밀양시", "사천시", "산청군", "양산시", "의령군", "진주시", "창녕군", "창원시 마산합포구", "창원시 마산회원구", "창원시 성산구", "창원시 의창구", "창원시 진해구", "통영시", "하동군", "함안군", "함양군", "합천군"
    ],
    "전라북도" : [
        "고창군", "군산시", "김제시", "남원시", "무주군", "부안군", "순창군", "완주군", "익산시", "임실군", "장수군", "전주시 덕진구", "전주시 완산구", "정읍시", "진안군"
    ],
    "전라남도" : [
        "강진군", "고흥군", "곡성군", "광양시", "구례군", "나주시", "담양군", "목포시", "무안군", "보성군", "순천시", "신안군", "여수시", "영광군", "영암군", "완도군", "장성군", "장흥군", "진도군", "함평군", "해남군", "화순군"
    ],
    "제주특별자치도" : [
        "서귀포시", "제주시"
    ]
};
export const heightCentimeterDB = [
    "140cm 이하",
    "141cm",
    "142cm",
    "143cm",
    "144cm",
    "145cm",
    "146cm",
    "147cm",
    "148cm",
    "150cm",
    "151cm",
    "152cm",
    "153cm",
    "154cm",
    "155cm",
    "156cm",
    "157cm",
    "158cm",
    "159cm",
    "160cm",
    "161cm",
    "162cm",
    "163cm",
    "164cm",
    "165cm",
    "166cm",
    "167cm",
    "168cm",
    "169cm",
    "170cm",
    "171cm",
    "172cm",
    "173cm",
    "174cm",
    "175cm",
    "176cm",
    "177cm",
    "178cm",
    "179cm",
    "180cm",
    "181cm",
    "182cm",
    "183cm",
    "184cm",
    "185cm",
    "186cm",
    "187cm",
    "188cm",
    "189cm",
    "190cm",
    "191cm",
    "192cm",
    "193cm",
    "194cm",
    "195cm",
    "196cm",
    "197cm",
    "198cm",
    "199cm",
    "200cm 이상"
];
export const jobDB = ["한의사", "의사", "치과의사", "약사", "변호사", "판사", "검사", "회계사"];
export const schoolDB = [
    "경희대학교", "가천대학교", "상지대학교", "세명대학교", "대전대학교", "원광대학교", "우석대학교", "동신대학교", "동국대학교", "대구한의대학교", "동의대학교", "부산대학교"];
export const religionDB = ["없음", "기독교", "불교", "천주교", "원불교","이슬람교", "기타"];
export const earnPerYearDB = [
    "2000 만원",
    "3000 만원",
    "5000 만원",
    "8000 만원",
    "1억",
    "1억 5000 만원",
    "2억",
    "3억",
    "5억"
];
export const hobbyDB = [
    "드라이브",
    "언어교환",
    "브런치",
    "전시회 관람",
    "술 한잔",
    "스포츠 경기 관람",
    "커피 한잔",
    "요가/필라테스",
    "솔직한 대화",
    "반려동물관 산책",
    "맛집 탐방",
    "런닝",
    "골프",
    "여행",
    "새로운것 배우기",
    "심심할때 수다",
    "동네 산책",
    "한강에서 치맥",
    "쇼핑",
    "인스타 감성카페 투어",
    "영화감상",
    "운동",
    "PC게임",
    "음악감상",
    "사진찍기",
    "요리",
    "등산",
    "댄스",
    "독서",
    "캠핑"
];
export const drinkDB = [
    "안마심",
    "못마심",
    "어쩔 수 없을때만",
    "가끔",
    "즐기는편",
    "자주마심"
];
export const smokeDB = [
    "흡연",
    "비흡연",
    "금연중"
];
export const characterDB = [
    "활발한",
    "긍정적인",
    "자상한",
    "꼼꼼한",
    "상냥한",
    "화끈한",
    "도발적인",
    "털털한",
    "부드러운",
    "귀여운",
    "도도한",
    "열정적인",
    "유머있는",
    "낙천적인",
    "신중한",
    "지적인",
    "대범한",
    "창의적인",
    "애교있는",
    "성실한",
    "단순한",
    "친절한",
    "소심한",
    "엉뚱한",
    "주도적인",
    "조용한",
    "차분한"
];
export const bodyFormDB = [
    "마른",
    "슬림한",
    "보통",
    "통통한",
    "약간 볼륨있는",
    "볼륨있는",
    "글래머",
    "섹시한"
];
export const styleDB = [
    "어메리칸 스타일",
    "섹시한 스타일",
    "힙합 스타일",
    "스나이퍼 스타일",
    "스케이트보더 스타일",
    "니뽄 스타일",
    "짱깨 스타일",
    "좁밥 스타일"
];
export const schoolSegmentDB = ["상관없음", "같은 학교 배제"];
export const drinkSegmentDB = ["상관없음", "안마시는 사람", "적당히 즐기는 사람"];
export const smokeSegmentDB = ["상관없음", "비흡연자"];
export const roomStatusText = ["대기중", "진행중", "풀방", "종료"];
export const roomStatusColor = ["skyblue", "green", "orange", "gray"];
export const roomDB = [
    {
        name: "소개팅",
        kindOf: [{max: 2 , alias: ""}]
    },
    {
        name: "미팅",
        kindOf: [{max: 4, alias: "2:2"}, {max: 6, alias: "3:3"}, {max: 8, alias: "4:4"}]
    },
    {
        name: "왕게임",
        kindOf: [{max: 2 , alias: "2인"},{max: 3, alias: "3인"},{max: 4, alias: "4인"},{max: 5, alias: "5인"},{max: 6, alias: "6인"},{max: 7, alias: "7인"},{max: 8, alias: "8인"}],
        subName: ['외모왕', '몸매왕', '능력왕', '자산왕', '거지왕']
    },
    {
        name: "광장",
        kindOf: [{max: 30 , alias: "30인"}]
    },
    {
        name: "블라인드 프로필",
        kindOf: [{max: 2 , alias: ""}]
    },
]
export const minimalizeAddressDB = {
    "서울특별시" : "서울",
    "경기도" : "경기",
    "인천광역시": "인천",
    "부산광역시" : "부산",
    "대전광역시" : "대전",
    "대구광역시" : "대구",
    "울산광역시" : "울산",
    "세종특별자치시" : "세종",
    "광주광역시" : "광주",
    "강원도" : "강원",
    "충청북도" : "충북",
    "충청남도" : "충남",
    "경상북도" : "경북",
    "경상남도" : "경남",
    "전라북도" : "전북",
    "전라남도" : "전남",
    "제주특별자치도" : "제주"
};
export const sogaetingQuestionDB = [
    {
        title: "밤에 잘때 무엇을 입고 자나요?",
        selection: []
    },
    {
        title: "최근 마지막 키스는 언제?",
        selection: []
    },
    {
        title: "평균 연애 기간은 어떻게 되나요?",
        selection: []
    },
    {
        title: "삶이 무엇인가요?",
        selection: []
    },
    {
        title: "사랑이 무엇인가요?",
        selection: []
    },
    {
        title: "이 우주는 끝이 있나요?",
        selection: []
    },
    {
        title: "우리는 시뮬레이션 속에 살고있나요?",
        selection: []
    },
    {
        title: "문재인 대가리 언제 깨지나요?",
        selection: []
    },
    {
        title: "최저임금 인상에 대하여 어떻게 생각하시나요?",
        selection: []
    },
    {
        title: "코로나는 음모론일까요?",
        selection: []
    },
    {
        title: "사랑은 아프려고 하는거죠?",
        selection: []
    },
    {
        title: "君の名は｡",
        selection: []
    },
    {
        title: "Где вы живете?",
        selection: []
    },
    {
        title: "Waar woon jy?",
        selection: []
    },
    {
        title: "คุณอาศัยอยู่ที่ไหน?",
        selection: []
    },
    {
        title: "아나까나 까나리 까니 키퍼웨이",
        selection: []
    },
    {
        title: "왜 그댈 사랑할 순 없나요?",
        selection: []
    },
    {
        title: "파울리 배타 원리란?",
        selection: []
    },
    {
        title: "독일의 물리학자 베르너 하이젠베르크(Werner Heisenberg, 1901~1976)가 제안한 불확정성의 원리는?",
        selection: []
    },
    {
        title: "오겡끼데스까",
        selection: []
    },
    {
        title: "동해물과백두산이",
        selection: []
    },
    {
        title: "마르고 닳도록",
        selection: []
    },
    {
        title: "ㄴ미ㅏㄹㄴ미ㅏ로ㅓㄴ미;옴나오허먼",
        selection: []
    }
]
export const sogaetingNoticeDB = [
    {
        title: "알림",
        selection: [
            "상대방이 입장할때까지 잠시 기다려주세요.",
            "상대방이 입장하면 시작버튼이 활성화 됩니다.",
        ]
    },
    {
        title: "알림",
        selection: [
            "방장이 시작버튼을 누루면 소개팅이 시작됩니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "대화가 끝났습니다.",
            "추가 대화 주제를 더 진행 하겠습니까?",
        ]
    },
    {
        title: "알림",
        selection: [
            "소개팅이 끝났습니다",
            "서로 친구 등록을 하시겠습니까?"
        ]
    },
    {
        title: "알림",
        selection: [
            "소개팅이 종료되었습니다."
        ]
    }
]
export const plazaQuestionDB = [
    {
        title: "올해 여름 휴가는 어디로 가나요?",
        selection: [
            "국내",
            "해외",
            "방콕",
            "니 마음속"
        ]
    },
    {
        title: "짜장면이 좋나요? 짬뽕이 좋나요?",
        selection: [
            "짜장",
            "짬뽕",
        ]
    },
    {
        title: "탕수육 소스를 부어먹나요? 찍어먹나요?",
        selection: [
            "부먹",
            "찍먹",
            "없어서 못먹",
            "처먹처먹"
        ]
    },
    {
        title: "가장 좋아하는 음식은?",
        selection: [
            "치킨",
            "피자",
            "라면",
            "김치"
        ]
    },
    {
        title: "이성을 볼때 제일 먼저 보는곳은?",
        selection: [
            "얼굴",
            "몸매",
            "재산",
            "학벌",
            "종교"
        ]
    },
    {
        title: "좋아하는 가수는?",
        selection: [
            "송창식",
            "김광석",
            "BTS",
            "아이유",
            "레이디가가"
        ]
    },
    {
        title: "좋아하는 동물은?",
        selection: [
            "고양이",
            "강아지",
            "조랑말",
            "티라노사우르스",
            "술취한 사람"
        ]
    },
    {
        title: "지금 주머니에 들어있는 것은?",
        selection: [
            "정액 묻은 휴지",
            "먼지",
            "1억",
            "공기",
            "여자 팬티"
        ]
    },
    {
        title: "당신의 정치 성향은?",
        selection: [
            "보수",
            "진보",
            "태극기",
            "대깨문",
            "종북세력"
        ]
    },
    {
        title: "좋아하는 스포츠는?",
        selection: [
            "축구",
            "야구",
            "마라톤",
            "역도",
            "레슬링"
        ]
    },
    {
        title: "가장 자신있는 신체 부위는?",
        selection: [
            "눈",
            "입",
            "다리",
            "엉덩이",
            "존슨"
        ]
    },
    {
        title: "스타크래프트 주 종족은?",
        selection: [
            "저그",
            "테란",
            "프로토스",
            "랜덤"
        ]
    },
    {
        title: "가장 좋아하는 과목?",
        selection: [
            "수학",
            "과학",
            "국어",
            "영어",
            "국사"
        ]
    },
    {
        title: "싸울때 선빵 날려야되는 곳은?",
        selection: [
            "아구창",
            "귓방맹이",
            "눈깔",
            "목젖",
            "존슨"
        ]
    }
];
export const plazaNoticeDB = [
    {
        title: "알림",
        selection: [
            "최소 인원이 참여하면 랜덤 질문이 시작됩니다.",
            "질문에 대한 선택이 10개 이상 같은 회원은 자동으로 친구로 추가됩니다.",
        ]
    },
    {
        title: "알림",
        selection: [
            "최소 인원이 부족하여 랜덤질문이 중단됩니다.",
            "최소 인원이 다시 참여하면 랜덤 질문이 시작됩니다.",
        ]
    },
    {
        title: "알림",
        selection: [
            "준비된 모든 질문이 끝났습니다.",
            "남아서 자유로운 채팅이 가능합니다.",
        ]
    }
];
export const meetingQuestionDB = [
    {
        title: "아이엠 그라운드 자기소개 하기",
        selection: []
    },
    {
        title: "밤에 잘때 무엇을 입고 자나요?",
        selection: []
    },
    {
        title: "최근 마지막 키스는 언제?",
        selection: []
    },
    {
        title: "평균 연애 기간은 어떻게 되나요?",
        selection: []
    },
    {
        title: "삶이 무엇인가요?",
        selection: []
    },
    {
        title: "사랑이 무엇인가요?",
        selection: []
    },
    {
        title: "이 우주는 끝이 있나요?",
        selection: []
    },
    {
        title: "우리는 시뮬레이션 속에 살고있나요?",
        selection: []
    },
    {
        title: "문재인 대가리 언제 깨지나요?",
        selection: []
    },
    {
        title: "최저임금 인상에 대하여 어떻게 생각하시나요?",
        selection: []
    },
    {
        title: "코로나는 음모론일까요?",
        selection: []
    },
    {
        title: "사랑은 아프려고 하는거죠?",
        selection: []
    },
    {
        title: "君の名は｡",
        selection: []
    },
    {
        title: "Где вы живете?",
        selection: []
    },
    {
        title: "Waar woon jy?",
        selection: []
    },
    {
        title: "คุณอาศัยอยู่ที่ไหน?",
        selection: []
    },
    {
        title: "아나까나 까나리 까니 키퍼웨이",
        selection: []
    },
    {
        title: "왜 그댈 사랑할 순 없나요?",
        selection: []
    },
    {
        title: "파울리 배타 원리란?",
        selection: []
    },
    {
        title: "독일의 물리학자 베르너 하이젠베르크(Werner Heisenberg, 1901~1976)가 제안한 불확정성의 원리는?",
        selection: []
    },
    {
        title: "오겡끼데스까",
        selection: []
    },
    {
        title: "동해물과백두산이",
        selection: []
    },
    {
        title: "마르고 닳도록",
        selection: []
    },
    {
        title: "ㄴ미ㅏㄹㄴ미ㅏ로ㅓㄴ미;옴나오허먼",
        selection: []
    }
]
export const meetingNoticeDB = [
    {
        title: "알림",
        selection: [
            "안녕하세요. 잠시 기다려주세요.",
            "남녀 숫자(각각 2명 이상)가 맞으면 방장이 미팅을 시작할수있습니다.",
        ]
    },
    {
        title: "알림",
        selection: [
            "방장이 시작버튼을 누루면 소개팅이 시작됩니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "대화가 끝났습니다.",
            "추가 대화 주제를 더 진행 하겠습니까?",
        ]
    },
    {
        title: "알림",
        selection: [
            "미팅이 끝났습니다",
            "맘에드는 이성을 선택해주세요"
        ]
    },
    {
        title: "알림",
        selection: [
            "미팅이 종료되었습니다."
        ]
    },
]
export const kingGameQuestionDB = [
    {
        title: "아이엠 그라운드 자기소개 하기",
        selection: []
    },
    {
        title: "밤에 잘때 무엇을 입고 자나요?",
        selection: []
    },
    {
        title: "최근 마지막 키스는 언제?",
        selection: []
    },
    {
        title: "평균 연애 기간은 어떻게 되나요?",
        selection: []
    },
    {
        title: "삶이 무엇인가요?",
        selection: []
    },
    {
        title: "사랑이 무엇인가요?",
        selection: []
    },
    {
        title: "이 우주는 끝이 있나요?",
        selection: []
    },
    {
        title: "우리는 시뮬레이션 속에 살고있나요?",
        selection: []
    },
    {
        title: "문재인 대가리 언제 깨지나요?",
        selection: []
    },
    {
        title: "최저임금 인상에 대하여 어떻게 생각하시나요?",
        selection: []
    },
    {
        title: "코로나는 음모론일까요?",
        selection: []
    },
    {
        title: "사랑은 아프려고 하는거죠?",
        selection: []
    },
    {
        title: "君の名は｡",
        selection: []
    },
    {
        title: "Где вы живете?",
        selection: []
    },
    {
        title: "Waar woon jy?",
        selection: []
    },
    {
        title: "คุณอาศัยอยู่ที่ไหน?",
        selection: []
    },
    {
        title: "아나까나 까나리 까니 키퍼웨이",
        selection: []
    },
    {
        title: "왜 그댈 사랑할 순 없나요?",
        selection: []
    },
    {
        title: "파울리 배타 원리란?",
        selection: []
    },
    {
        title: "독일의 물리학자 베르너 하이젠베르크(Werner Heisenberg, 1901~1976)가 제안한 불확정성의 원리는?",
        selection: []
    },
    {
        title: "오겡끼데스까",
        selection: []
    },
    {
        title: "동해물과백두산이",
        selection: []
    },
    {
        title: "마르고 닳도록",
        selection: []
    },
    {
        title: "ㄴ미ㅏㄹㄴ미ㅏ로ㅓㄴ미;옴나오허먼",
        selection: []
    }
];
export const kingGameNoticeDB = [
    {
        title: "알림",
        selection: [
            "안녕하세요. 잠시 기다려주세요.",
            "왕게임 참가자를 기다립니다.",
        ]
    },
    {
        title: "알림",
        selection: [
            "방장이 시작버튼을 누루면 왕게임이 시작됩니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "방장의 프로필을 소개합니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "대화가 끝났습니다.",
            "추가 대화 주제를 더 진행 하겠습니까? ( 방장이 선택 )",
        ]
    },
    {
        title: "알림",
        selection: [
            "왕게임이 끝났습니다",
            "방장이 1등을 뽑습니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "방장과 선택받는 1인의 친구 수락 과정"
        ]
    },
    {
        title: "알림",
        selection: [
            "왕게임이 종료되었습니다."
        ]
    }
];
export const blindProfileNoticeDB = [
    {
        title: "알림",
        selection: [
            "이상형 찾기 버튼을 눌러서 이상형을 초대해보세요"
        ]
    },
    {
        title: "알림",
        selection: [
            "방장이 시작버튼을 누루면 블라인드 프로필이 시작됩니다."
        ]
    },
    {
        title: "알림",
        selection: [
            "프로필을 보고 좋아요/상관없음/별로에요 를 눌러주세요."
        ]
    },
    {
        title: "알림",
        selection: [
            "종료"
        ]
    },
];
export const somoimCategoryDB = [
    "여행",
    "스포츠",
    "인문학",
    "외국어",
    "음악",
    "봉사활동",
    "기타"
]
export const memberGradeAlias = {
    0: '모임장',
    98: '일반 회원',
    99: '게스트'
}

export const somoimBoardCategory = ['자유 글', '관심사 공유', '정모후기', '가입인사', '공지사항']